app/Filters/Auth.php

SELECT *
FROM `auth_user`
WHERE `auth_user_token` = 'eyJ0eXAiOiJKV1QiLCJhbGciOiJIUzI1NiJ9.eyJpYXQiOjEzNTY5OTk1MjQsIm5iZiI6MTM1NzAwMDAwMCwidWlkIjoiOSIsImVtYWlsIjoiZmxveWRAZ21haWwuY29tIn0.iGZE2ZalBOqwhm71G4x_599gFa73oj7_iMSsRfy68xQ'
---
                ]);
        } else {
            $tabel = $db->table('auth_user');
            $user = $tabel->where('auth_user_token', $token)->get()->getFirstRow('array');