app/Controllers/User.php

SELECT *
FROM `user`
WHERE `user_email` = 'floyd@gmail.com'
---
    public function login()
    {
        $post = $this->request->getPost();
        $db = db_connect();

        helper(['form']);
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required'
        ];

        if (!$this->validate($rules)) {
            return $this->fail($this->validator->getErrors());
        }

        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        $tabel = $db->table('user');
        $user = $tabel->where('user_email', $email)->get()->getFirstRow('array');